app/controllers/accounts_controller.rb

  def show
    @account = Account.find(params[:id])
    @new_transaction = Transaction.new
    @new_transaction.account_id = @account.id

    @institution = Institution.find(:first, :conditions => { :id => @account.institution_id})
    @transactions = Transaction.find(:all, :conditions => { :account_id => @account.id}, :order => "date" )
    @all_categories = Category.sorted_find_all
    @transaction_types = TransactionType.find(:all)
---
SELECT * FROM `transaction_types` WHERE (`transaction_types`.`id` IS NULL) LIMIT 1