app/controllers/accounts_controller.rb

  def index
    @accounts = Account.by_user(current_user).all
---
SELECT * FROM `accounts` ORDER BY name

  def show
    @account = Account.by_user(current_user).find(params[:id])
    @new_transaction = Transaction.new
    @new_transaction.account_id = @account.id

    @institution = Institution.find(@account.institution_id)
    @transactions = Transaction.all(:conditions => { :account_id => @account.id}, :order => "date" )
    @all_categories = Category.sorted_find_all current_user.default_workgroup
    @transaction_types = TransactionType.all
---
SELECT * FROM "users" WHERE ("users"."id" = E'1') LIMIT 1
SELECT * FROM `accounts` WHERE (`accounts`.`id` = 1)
SELECT * FROM `institutions` WHERE (`institutions`.`id` = 1) LIMIT 1
SELECT * FROM `transactions` WHERE (`transactions`.`account_id` = 1) ORDER BY date
SELECT * FROM `transaction_types`

  def new
    @account = Account.new
    @all_institutions = Institution.all
---
SELECT * FROM `institutions`

  def edit
    @account = Account.by_user(current_user).find(params[:id])
    @all_institutions = Institution.all
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = E'1') LIMIT 1
SELECT * FROM "institutions"

  def create
    @account = Account.new(params[:account])
    respond_to do |format|
      if @account.save
        flash[:notice] = 'Account was successfully created.'
        format.html { redirect_to(@account) }
        format.xml  { render :xml => @account, :status => :created, :location => @account }
      else
        @all_institutions = Institution.all
---
INSERT INTO "accounts" ("name", "updated_at", "info", "interest_rate", "opening_date", "type", "interest_accrual", "workgroup_id", "description", "institution_id", "phone", "account_number", "created_at", "interest_condition") VALUES(E'Stimulant Loan', '2010-08-07 02:05:13.946312', E'', 54, '2010-05-01', NULL, E'monthly', 2, E'', 14, E'', E'', '2010-08-07 02:05:13.946312', E'negative_balance') RETURNING "id"
SELECT * FROM "institutions"

  def update
    @account = Account.by_user(current_user).find(params[:id])

    respond_to do |format|
      if @account.update_attributes(params[:account])
        flash[:notice] = 'Account was successfully updated.'
        format.html { redirect_to(@account) }
        format.xml  { head :ok }
      else
        @all_institutions = Institution.all
---
SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = E'1') LIMIT 1
UPDATE "accounts" SET "opening_date" = '2010-08-07', "interest_accrual" = E'monthly', "interest_condition" = E'positive_balance', "interest_rate" = 54, "updated_at" = '2010-08-07 01:57:43.410323' WHERE "id" = 1
UPDATE "users" SET "perishable_token" = E'n_0UJeQhSN_ijcMCntmX', "last_request_at" = '2010-08-07 01:51:47.006513', "updated_at" = '2010-08-07 01:51:47.014768' WHERE "id" = 1
SELECT * FROM "institutions"