app/controllers/categories_controller.rb

INSERT INTO `categories` (`name`, `updated_at`, `parent_id`, `created_at`) VALUES('Income', '2009-05-29 15:07:44', NULL, '2009-05-29 15:07:44')
---
  def create
    @category = Category.new(params[:category])
    @category.workgroup = current_user.default_workgroup
    @all_categories = Category.sorted_find_all current_user.default_workgroup

    respond_to do |format|
      if @category.save