app/controllers/transactions_controller.rb

  def create
    @transaction = Transaction.new(params[:transaction])
    @account = @transaction.account
    @all_categories = Category.sorted_find_all current_user.default_workgroup
    @all_accounts = Account.find(:all)
    @transaction_types = TransactionType.find(:all)

    respond_to do |format|
      if @transaction.save
---
SELECT * FROM `accounts` WHERE (`accounts`.`id` = 1) LIMIT 1
INSERT INTO "transactions" ("updated_at", "account_id", "transaction_type_id", "registered", "date", "description", "amount", "category_id", "check_num", "linked_account_id", "target", "created_at") VALUES('2010-08-07 02:44:05.973066', 8, 2, 'f', '2010-07-01', E'', 50000, NULL, E'', NULL, E'Payment', '2010-08-07 02:44:05.973066') RETURNING "id"

  def remote_update
    @transaction = Transaction.find(params[:id])
#    debugger

    respond_to do |format|
      if @transaction.update_attributes(params[:transaction])
---
SELECT * FROM "transactions" WHERE ("transactions"."id" = 29)
UPDATE "transactions" SET "amount" = 1419404, "transaction_type_id" = 1, "updated_at" = '2010-08-07 02:43:59.118005' WHERE "id" = 29

  def destroy
    @transaction = Transaction.find(params[:id])
    @account = @transaction.account
    @transaction.destroy
---
SELECT * FROM "transactions" WHERE ("transactions"."id" = 26)
DELETE FROM "transactions" WHERE "id" = 26