app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.admin_flag = false unless current_user && current_user.is_admin?
    if @user.save
---
INSERT INTO "users" ("last_login_at", "last_request_at", "updated_at", "crypted_password", "single_access_token", "perishable_token", "current_login_ip", "password_salt", "current_login_at", "failed_login_count", "admin_flag", "persistence_token", "login_count", "login", "email", "last_login_ip", "created_at") VALUES(NULL, '2010-08-02 04:52:19.277056', '2010-08-02 04:52:19.278104', E'0a20c0fa4d27c76743c1c2227a4a9214620d8953478dde783a0bfd4416693e9063544e8b31386507c85a296b2d5ea0cc15e6342ed63a3d23d1b06080194df8da', E'vewomI6SpCVqsgIdngmL', E'Ha2IlUaI1FOwtI9HU5Cr', E'127.0.0.1', E'IKv-P0EvgCwAkCvsCu8F', '2010-08-02 04:52:19.276504', 0, NULL, E'763d79af304a85cbad05225fb21465b9ecd570989f89f74d90dea96be5222f1942db3021dc0257f2d899ac77c2a8589b2b97a688f32192664cd5909e0575e1ad', 1, E'bdoughty', E'billyd.atx@gmail.com', NULL, '2010-08-02 04:52:19.278104') RETURNING "id"